from random import * #import des modules
F=[0,0,0,0,0,0,0,0,0,0,0,0] #définition de la liste
#__          __  _____   _____                                                                                                                           _                                                                  _                                         _     _                 
# \ \        / / |_   _| |  __ \                                                                                                                         | |                                                                | |                                       | |   (_)                
#  \ \  /\  / /    | |   | |__) |  ______      ___    ___     _ __    _ __    ___     __ _   _ __    __ _   _ __ ___    _ __ ___     ___      ___   ___  | |_      ___   _ __       ___    ___    _   _   _ __   ___      __| |   ___      ___   _ __    ___    __ _  | |_   _    ___    _ __  
#   \ \/  \/ /     | |   |  ___/  |______|    / __|  / _ \   | '_ \  | '__|  / _ \   / _` | | '__|  / _` | | '_ ` _ \  | '_ ` _ \   / _ \    / _ \ / __| | __|    / _ \ | '_ \     / __|  / _ \  | | | | | '__| / __|    / _` |  / _ \    / __| | '__|  / _ \  / _` | | __| | |  / _ \  | '_ \ 
#    \  /\  /     _| |_  | |                 | (__  |  __/   | |_) | | |    | (_) | | (_| | | |    | (_| | | | | | | | | | | | | | |  __/   |  __/ \__ \ | |_    |  __/ | | | |   | (__  | (_) | | |_| | | |    \__ \   | (_| | |  __/   | (__  | |    |  __/ | (_| | | |_  | | | (_) | | | | |
#     \/  \/     |_____| |_|                  \___|  \___|   | .__/  |_|     \___/   \__, | |_|     \__,_| |_| |_| |_| |_| |_| |_|  \___|    \___| |___/  \__|    \___| |_| |_|    \___|  \___/   \__,_| |_|    |___/    \__,_|  \___|    \___| |_|     \___|  \__,_|  \__| |_|  \___/  |_| |_|
#                                                            | |                      __/ |                                                                                                                                                                                                    
#                                                            |_|                     |___/                                                                                                                                                                                                     
#___________________________________________________________________
n=int(input("nombre de lancers : ")) #demande du nombre de lancers


for i in range(n) : 
    i=+1
    res=randint(1,6)+randint(1,6)                     #lancers de dés
    print(res)
    for j in range(13) :
        k=j-1               #analyse et incrementation
        if j==res:
            F[k]=F[k]+1
        j=+1
print([F]) #affichage de la liste, le premier chiffre est le nombre de fois que 1 est tombé, etc etc

#___________________________________________________________________

for a in range(12):#affichage des résultats
    b=a+1
    c=str(b)

    O=F[a]
    a=+1
    prct=(100*int(O))
    prct=prct/n
    print("le nombre "+ c +" est tombé :"+str(O)+" fois, sa fréquence est de " +str(O)+"/"+str(n)+" ou :"+str(prct)+"%")
    